## Feature Selection Methods
### 1-) FIlter Methods
### 2-) Embedded Methods
### 3-) Wrapper Methods

# Measures of Correlations
1-) Pearson
2-) Kendall
3-) Spearman

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [3]:
df = pd.read_csv('/home/coder/Desktop/MachineLearning/preparing-data-feature-engineering-machine-learning/02/demos/datasets/melb_data.csv')
df.head()

,Suburb,Address,Rooms,Type,Price,Method,SellerG,Date,Distance,Postcode,...,Bathroom,Car,Landsize,BuildingArea,YearBuilt,CouncilArea,Lattitude,Longtitude,Regionname,Propertycount
0,Abbotsford,85 Turner St,2,h,1480000.0,S,Biggin,3/12/2016,2.5,3067.0,...,1.0,1.0,202.0,NaN,NaN,Yarra,-37.7996,144.9984,Northern Metropolitan,4019.0
1,Abbotsford,25 Bloomburg St,2,h,1035000.0,S,Biggin,4/02/2016,2.5,3067.0,...,1.0,0.0,156.0,79.0,1900.0,Yarra,-37.8079,144.9934,Northern Metropolitan,4019.0
2,Abbotsford,5 Charles St,3,h,1465000.0,SP,Biggin,4/03/2017,2.5,3067.0,...,2.0,0.0,134.0,150.0,1900.0,Yarra,-37.8093,144.9944,Northern Metropolitan,4019.0
3,Abbotsford,40 Federation La,3,h,850000.0,PI,Biggin,4/03/2017,2.5,3067.0,...,2.0,1.0,94.0,NaN,NaN,Yarra,-37.7969,144.9969,Northern Metropolitan,4019.0
4,Abbotsford,55a Park St,4,h,1600000.0,VB,Nelson,4/06/2016,2.5,3067.0,...,1.0,2.0,120.0,142.0,2014.0,Yarra,-37.8072,144.9941,Northern Metropolitan,4019.0

In [9]:
df.isnull().sum().sort_values(ascending=False)

BuildingArea     6450
YearBuilt        5375
CouncilArea      1369
Car                62
Propertycount       0
Date                0
Address             0
Rooms               0
Type                0
Price               0
Method              0
SellerG             0
Bedroom2            0
Distance            0
Postcode            0
Regionname          0
Bathroom            0
Landsize            0
Lattitude           0
Longtitude          0
Suburb              0
dtype: int64

In [5]:
df.shape

(13580, 21)

In [6]:
df.shape[0]

13580

In [7]:
(df.isnull().sum()/df.shape[0]).sort_values(ascending=False)

BuildingArea     0.474963
YearBuilt        0.395803
CouncilArea      0.100810
Car              0.004566
Propertycount    0.000000
Date             0.000000
Address          0.000000
Rooms            0.000000
Type             0.000000
Price            0.000000
Method           0.000000
SellerG          0.000000
Bedroom2         0.000000
Distance         0.000000
Postcode         0.000000
Regionname       0.000000
Bathroom         0.000000
Landsize         0.000000
Lattitude        0.000000
Longtitude       0.000000
Suburb           0.000000
dtype: float64

In [11]:
df[['BuildingArea','YearBuilt','CouncilArea','Car']]

       BuildingArea  YearBuilt CouncilArea  Car
0               NaN        NaN       Yarra  1.0
1              79.0     1900.0       Yarra  0.0
2             150.0     1900.0       Yarra  0.0
3               NaN        NaN       Yarra  1.0
4             142.0     2014.0       Yarra  2.0
...             ...        ...         ...  ...
13575           NaN     1981.0         NaN  2.0
13576         133.0     1995.0         NaN  2.0
13577           NaN     1997.0         NaN  4.0
13578         157.0     1920.0         NaN  5.0
13579         112.0     1920.0         NaN  1.0

[13580 rows x 4 columns]

In [16]:
l = df.isnull().sum().sort_values(ascending=False)

In [19]:
df1 = pd.DataFrame(l)
df1

                  0
BuildingArea   6450
YearBuilt      5375
CouncilArea    1369
Car              62
Propertycount     0
Date              0
Address           0
Rooms             0
Type              0
Price             0
Method            0
SellerG           0
Bedroom2          0
Distance          0
Postcode          0
Regionname        0
Bathroom          0
Landsize          0
Lattitude         0
Longtitude        0
Suburb            0

In [22]:
df1.index

Index(['BuildingArea', 'YearBuilt', 'CouncilArea', 'Car', 'Propertycount',
       'Date', 'Address', 'Rooms', 'Type', 'Price', 'Method', 'SellerG',
       'Bedroom2', 'Distance', 'Postcode', 'Regionname', 'Bathroom',
       'Landsize', 'Lattitude', 'Longtitude', 'Suburb'],
      dtype='object')

In [25]:
l = list(df1.index[0:4])

In [26]:
df[l]

       BuildingArea  YearBuilt CouncilArea  Car
0               NaN        NaN       Yarra  1.0
1              79.0     1900.0       Yarra  0.0
2             150.0     1900.0       Yarra  0.0
3               NaN        NaN       Yarra  1.0
4             142.0     2014.0       Yarra  2.0
...             ...        ...         ...  ...
13575           NaN     1981.0         NaN  2.0
13576         133.0     1995.0         NaN  2.0
13577           NaN     1997.0         NaN  4.0
13578         157.0     1920.0         NaN  5.0
13579         112.0     1920.0         NaN  1.0

[13580 rows x 4 columns]

In [27]:
df[l].isnull().sum()

BuildingArea    6450
YearBuilt       5375
CouncilArea     1369
Car               62
dtype: int64

In [28]:
df[l].describe()

       BuildingArea    YearBuilt           Car
count   7130.000000  8205.000000  13518.000000
mean     151.967650  1964.684217      1.610075
std      541.014538    37.273762      0.962634
min        0.000000  1196.000000      0.000000
25%       93.000000  1940.000000      1.000000
50%      126.000000  1970.000000      2.000000
75%      174.000000  1999.000000      2.000000
max    44515.000000  2018.000000     10.000000

In [29]:
df['Car'] = df['Car'].fillna(df['Car'].median())
df[l].describe()

       BuildingArea    YearBuilt           Car
count   7130.000000  8205.000000  13580.000000
mean     151.967650  1964.684217      1.611856
std      541.014538    37.273762      0.960793
min        0.000000  1196.000000      0.000000
25%       93.000000  1940.000000      1.000000
50%      126.000000  1970.000000      2.000000
75%      174.000000  1999.000000      2.000000
max    44515.000000  2018.000000     10.000000

In [32]:
df[l].isnull().sum()

BuildingArea    6450
YearBuilt       5375
CouncilArea     1369
Car                0
dtype: int64

In [40]:
mode = df['CouncilArea'].mode()
mode[0]

'Moreland'

In [38]:
df['CouncilArea'] = df['CouncilArea'].fillna(mode[0])

In [42]:
df[l].isnull().sum()

BuildingArea    6450
YearBuilt       5375
CouncilArea        0
Car                0
dtype: int64

In [43]:
df[l].tail()

       BuildingArea  YearBuilt CouncilArea  Car
13575           NaN     1981.0    Moreland  2.0
13576         133.0     1995.0    Moreland  2.0
13577           NaN     1997.0    Moreland  4.0
13578         157.0     1920.0    Moreland  5.0
13579         112.0     1920.0    Moreland  1.0

In [44]:
df.dropna(thresh=int(df.shape[0]*0.9), axis=1, inplace=True)

In [45]:
df.columns

Index(['Suburb', 'Address', 'Rooms', 'Type', 'Price', 'Method', 'SellerG',
       'Date', 'Distance', 'Postcode', 'Bedroom2', 'Bathroom', 'Car',
       'Landsize', 'CouncilArea', 'Lattitude', 'Longtitude', 'Regionname',
       'Propertycount'],
      dtype='object')

In [46]:
df.isnull().sum()

Suburb           0
Address          0
Rooms            0
Type             0
Price            0
Method           0
SellerG          0
Date             0
Distance         0
Postcode         0
Bedroom2         0
Bathroom         0
Car              0
Landsize         0
CouncilArea      0
Lattitude        0
Longtitude       0
Regionname       0
Propertycount    0
dtype: int64